In [76]:
#import libraries

import pandas as pd
import numpy as np
import regex as re

import requests

import seaborn as sns
import matplotlib.pyplot as plt

from getpass import getpass
import sqlalchemy as alch 
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

### Importing, exploring, cleaning the datasets

In [19]:
#import dataset with most popular names

top_names = pd.read_csv('../data/Popular_Baby_Names_2011_2019.csv')
top_names

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2011,FEMALE,HISPANIC,GERALDINE,13,75
1,2011,FEMALE,HISPANIC,GIA,21,67
2,2011,FEMALE,HISPANIC,GIANNA,49,42
3,2011,FEMALE,HISPANIC,GISELLE,38,51
4,2011,FEMALE,HISPANIC,GRACE,36,53
...,...,...,...,...,...,...
57577,2014,MALE,WHITE NON HISPANIC,Yousef,18,94
57578,2014,MALE,WHITE NON HISPANIC,Youssef,24,88
57579,2014,MALE,WHITE NON HISPANIC,Yusuf,16,96
57580,2014,MALE,WHITE NON HISPANIC,Zachary,90,39
57581,2014,MALE,WHITE NON HISPANIC,Zev,49,65

In [20]:
#get info & check for null values -> none

top_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57582 entries, 0 to 57581
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Year of Birth       57582 non-null  int64
 1   Gender              57582 non-null  object
 2   Ethnicity           57582 non-null  object
 3   Child's First Name  57582 non-null  object
 4   Count               57582 non-null  int64
 5   Rank                57582 non-null  int64
dtypes: int64(3), object(3)
memory usage: 2.6+ MB

In [21]:
#which years the dataset covers -> 2011-2019

top_names['Year of Birth'].unique()

array([2011, 2013, 2012, 2014, 2017, 2018, 2016, 2015, 2019])

In [22]:
#what is the minimum occurence of a name (not all names/births are included here) -> 10

top_names['Count'].min()

10

In [23]:
#check for values in Ethnicity column
#some values are doubled, with different spelling

top_names['Ethnicity'].value_counts()

Ethnicity
HISPANIC                      16930
WHITE NON HISPANIC            16127
BLACK NON HISPANIC             8335
ASIAN AND PACIFIC ISLANDER     7830
WHITE NON HISP                 4142
ASIAN AND PACI                 2125
BLACK NON HISP                 2093
Name: count, dtype: int64

In [24]:
#import dataset with all live births

all_births = pd.read_csv('../data/Percent_Live_Births_by_Infant_Sex_and_Mother_s_Race_Ethnicity.csv')
all_births

     Birth Year Sex Of Infant Race or Ethnicity of Mother  Births Percentage
0          2013          Male          Non-Hispanic White  20,499       33.2
1          2013          Male                       Other     727        1.2
2          2011        Female                       Other     708        1.2
3          2010          Male                    Hispanic  20,015       31.3
4          2013        Female     Asian/ Pacific Islander   9,583       16.3
..          ...           ...                         ...     ...        ...
147        2019        Female     Asian/ Pacific Islander   8,969      1,660
148        2019        Female          Non-Hispanic White  19,084      3,540
149        2019        Female          Non-Hispanic Black   9,886      1,830
150        2019        Female                       Other     856        160
151        2019        Female         Not stated /Unknown     167         30

[152 rows x 5 columns]

In [25]:
all_births.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 152 entries, 0 to 151
Data columns (total 5 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Birth Year                   152 non-null    int64
 1   Sex Of Infant                152 non-null    object
 2   Race or Ethnicity of Mother  152 non-null    object
 3   Births                       152 non-null    object
 4   Percentage                   152 non-null    object
dtypes: int64(1), object(4)
memory usage: 6.1+ KB

In [26]:
#remove commas from Births column
#change type into int

#drop column Percentage

all_births['Births'] = all_births['Births'].str.replace(",", "")
all_births['Births'] = all_births['Births'].apply(lambda x: int(x))

all_births.drop(columns=['Percentage'], inplace=True)
all_births

     Birth Year Sex Of Infant Race or Ethnicity of Mother  Births
0          2013          Male          Non-Hispanic White   20499
1          2013          Male                       Other     727
2          2011        Female                       Other     708
3          2010          Male                    Hispanic   20015
4          2013        Female     Asian/ Pacific Islander    9583
..          ...           ...                         ...     ...
147        2019        Female     Asian/ Pacific Islander    8969
148        2019        Female          Non-Hispanic White   19084
149        2019        Female          Non-Hispanic Black    9886
150        2019        Female                       Other     856
151        2019        Female         Not stated /Unknown     167

[152 rows x 4 columns]

In [27]:
all_births.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 152 entries, 0 to 151
Data columns (total 4 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   Birth Year                   152 non-null    int64
 1   Sex Of Infant                152 non-null    object
 2   Race or Ethnicity of Mother  152 non-null    object
 3   Births                       152 non-null    int64
dtypes: int64(2), object(2)
memory usage: 4.9+ KB

In [28]:
#check for null values -> none

all_births.isna().sum()

Birth Year                     0
Sex Of Infant                  0
Race or Ethnicity of Mother    0
Births                         0
dtype: int64

In [29]:
#which years the dataset covers -> 2007-2019

all_births['Birth Year'].unique()

array([2013, 2011, 2010, 2007, 2012, 2008, 2009, 2014, 2015, 2016, 2017,
       2018, 2019])

In [30]:
#which ethnicities are included, do they match with the ones in top_names table? NO

all_births['Race or Ethnicity of Mother'].value_counts()

Race or Ethnicity of Mother
Non-Hispanic White         28
Other                      28
Hispanic                   28
Asian/ Pacific Islander    28
Non-Hispanic Black         28
Not stated /Unknown        12
Name: count, dtype: int64

In [31]:
#edit top_names column 'Ethnicity' to match with all_births table
#lambda

#white = ['WHITE NON HISPANIC', 'WHITE NON HISP']
#black = ['BLACK NON HISPANIC', 'BLACK NON HISP']
#asian = ['ASIAN AND PACIFIC ISLANDER', 'ASIAN AND PACI']

#top_names['Ethnicity'] = top_names['Ethnicity'].apply(lambda x: 'Non-Hispanic White' if x in white 
#                                                      else ('Non-Hispanic Black' if x in black
#                                                      else ('Asian/ Pacific Islander' if x in asian 
#                                                      else 'Hispanic')))

In [32]:
#top_names

In [33]:
#covert top_names column 'Ethnicity' to match with all_births table

def convert(x):
    if x in ['WHITE NON HISPANIC', 'WHITE NON HISP']:
        return 'Non-Hispanic White'
    elif x in ['BLACK NON HISPANIC', 'BLACK NON HISP']:
        return 'Non-Hispanic Black'
    elif x in ['ASIAN AND PACIFIC ISLANDER', 'ASIAN AND PACI']:
        return 'Asian/ Pacific Islander'
    else:
        return 'Hispanic'

In [34]:
top_names['Ethnicity'] = top_names['Ethnicity'].apply(convert)

In [35]:
#check if totals match, after converting

top_names['Ethnicity'].value_counts()

Ethnicity
Non-Hispanic White         20269
Hispanic                   16930
Non-Hispanic Black         10428
Asian/ Pacific Islander     9955
Name: count, dtype: int64

In [36]:
#covert top_names column 'Gender' to match with all_births table

top_names.Gender = top_names.Gender.str.replace('FEMALE', 'Female', regex=True)
top_names.Gender = top_names.Gender.str.replace('MALE', 'Male', regex=True)

top_names

,Year of Birth,Gender,Ethnicity,Child's First Name,Count,Rank
0,2011,Female,Hispanic,GERALDINE,13,75
1,2011,Female,Hispanic,GIA,21,67
2,2011,Female,Hispanic,GIANNA,49,42
3,2011,Female,Hispanic,GISELLE,38,51
4,2011,Female,Hispanic,GRACE,36,53
...,...,...,...,...,...,...
57577,2014,Male,Non-Hispanic White,Yousef,18,94
57578,2014,Male,Non-Hispanic White,Youssef,24,88
57579,2014,Male,Non-Hispanic White,Yusuf,16,96
57580,2014,Male,Non-Hispanic White,Zachary,90,39
57581,2014,Male,Non-Hispanic White,Zev,49,65

In [37]:
#add new column to top_names, with calculated frequency of top names per all births within the same ethnicity and sex

In [50]:
#import dataset with most popular baby names in each state

top_names_states = pd.read_csv('../data/US_baby_names_states/states.csv')
top_names_states

        State Sex  Year      Name  Count  Total  Count_Normalized
0          OR   F  1910   Dorothy     57   1373          0.041515
1          OR   F  1910      Mary     54   1373          0.039330
2          OR   F  1910     Helen     48   1373          0.034960
3          OR   F  1910      Ruth     46   1373          0.033503
4          OR   F  1910  Margaret     43   1373          0.031318
...       ...  ..   ...       ...    ...    ...               ...
6337729    PR   M  2021    Yeshua      5   6808          0.000734
6337730    PR   M  2021      Zael      5   6808          0.000734
6337731    PR   M  2021     Zahid      5   6808          0.000734
6337732    PR   M  2021    Zariel      5   6808          0.000734
6337733    PR   M  2021      Zyan      5   6808          0.000734

[6337734 rows x 7 columns]

In [51]:
#check for null values -> none

top_names_states.isna().sum()

State               0
Sex                 0
Year                0
Name                0
Count               0
Total               0
Count_Normalized    0
dtype: int64

In [52]:
#which years the dataset covers -> 1910-2021

top_names_states['Year'].value_counts()

Year
2008    96308
2016    96301
2015    96184
2009    95986
2014    95817
        ...
1914    28822
1913    25276
1912    23179
1911    17621
1910    16829
Name: count, Length: 112, dtype: int64

In [53]:
top_names_states['Year'].min()

1910

In [54]:
top_names_states['Year'].max()

2021

In [55]:
#what is the minimum occurence of a name (not all names/births are included here) -> 5

top_names_states['Count'].min()

5

### Loading dataframes into MySQL

In [56]:
# set the password

password = getpass("Please enter your password: ")

Please enter your password: Â·Â·Â·Â·Â·Â·Â·Â·

In [57]:
def load_dataframe_to_mysql(df, database, table, username, password, host='localhost', port=3306):
    """
    Load a Pandas DataFrame into a MySQL database table.
    
    Parameters:
    df (pandas.DataFrame): 
    database (str): 
    table (str): 
    username (str): 
    password (str): 
    host (str, optional): The hostname or IP address of the MySQL server (default is 'localhost').
    port (int, optional): The port number to use to connect to the MySQL server (default is 3306).
    """
    
    # create a MySQL engine using sqlalchemy
    engine = create_engine(f'mysql://{username}:{password}@{host}:{port}/{database}')

    # write the dataframe to a SQL table
    df.to_sql(name=table, con=engine, if_exists='replace', index=False)

    # close the database connection
    engine.dispose()

In [58]:
load_dataframe_to_mysql(top_names, 'baby_names', 'top_names', 'root', password)

In [59]:
load_dataframe_to_mysql(all_births, 'baby_names', 'all_births', 'root', password)

In [60]:
load_dataframe_to_mysql(top_names_states, 'baby_names', 'top_names_states', 'root', password)

### Joining tables

In [61]:
#call tables from SQL to python
#join names + music tables ON top charts song matching birth year

dbName = "baby_names"

In [92]:
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"

In [91]:
engine = alch.create_engine(connectionData)

In [66]:
names = pd.read_sql_query("""

SELECT top_names_states.*, song, decade
	FROM top_names_states
    JOIN 
		(SELECT year
				,decade
                ,song
			FROM (
			SELECT year
				,decade
                ,song
				,all_music.order
				,RANK() OVER (PARTITION BY year order by all_music.order) as ranking
			FROM all_music) AS my_table
			WHERE ranking = 1) as top_chart
	ON top_names_states.Year = top_chart.year;

""", engine)

names

,State,Sex,Year,Name,Count,Total,Count_Normalized,song,decade
0,OR,F,1920,Dorothy,274,5971,0.045888,Swanee - Al Jolson,1920
1,OR,F,1920,Mary,271,5971,0.045386,Swanee - Al Jolson,1920
2,OR,F,1920,Helen,211,5971,0.035337,Swanee - Al Jolson,1920
3,OR,F,1920,Margaret,194,5971,0.032490,Swanee - Al Jolson,1920
4,OR,F,1920,Betty,152,5971,0.025456,Swanee - Al Jolson,1920
...,...,...,...,...,...,...,...,...,...
6048748,PR,M,2021,Yeshua,5,6808,0.000734,Levitating - Dua Lipa,2020
6048749,PR,M,2021,Zael,5,6808,0.000734,Levitating - Dua Lipa,2020
6048750,PR,M,2021,Zahid,5,6808,0.000734,Levitating - Dua Lipa,2020
6048751,PR,M,2021,Zariel,5,6808,0.000734,Levitating - Dua Lipa,2020
6048752,PR,M,2021,Zyan,5,6808,0.000734,Levitating - Dua Lipa,2020

In [72]:
#adding column with string length of names

names['Name_length'] = names['Name'].str.len()
names

,State,Sex,Year,Name,Count,Total,Count_Normalized,song,decade,Name_length
0,OR,F,1920,Dorothy,274,5971,0.045888,Swanee - Al Jolson,1920,7
1,OR,F,1920,Mary,271,5971,0.045386,Swanee - Al Jolson,1920,4
2,OR,F,1920,Helen,211,5971,0.035337,Swanee - Al Jolson,1920,5
3,OR,F,1920,Margaret,194,5971,0.032490,Swanee - Al Jolson,1920,8
4,OR,F,1920,Betty,152,5971,0.025456,Swanee - Al Jolson,1920,5
...,...,...,...,...,...,...,...,...,...,...
6048748,PR,M,2021,Yeshua,5,6808,0.000734,Levitating - Dua Lipa,2020,6
6048749,PR,M,2021,Zael,5,6808,0.000734,Levitating - Dua Lipa,2020,4
6048750,PR,M,2021,Zahid,5,6808,0.000734,Levitating - Dua Lipa,2020,5
6048751,PR,M,2021,Zariel,5,6808,0.000734,Levitating - Dua Lipa,2020,6
6048752,PR,M,2021,Zyan,5,6808,0.000734,Levitating - Dua Lipa,2020,4

In [85]:
#save df to csv

names.to_csv('../data/names_states_music_CLEAN.csv', index=False)

In [86]:
pd.read_csv('../data/names_states_music_CLEAN.csv')

,State,Sex,Year,Name,Count,Total,Count_Normalized,song,decade,Name_length
0,OR,F,1920,Dorothy,274,5971,0.045888,Swanee - Al Jolson,1920,7
1,OR,F,1920,Mary,271,5971,0.045386,Swanee - Al Jolson,1920,4
2,OR,F,1920,Helen,211,5971,0.035337,Swanee - Al Jolson,1920,5
3,OR,F,1920,Margaret,194,5971,0.032490,Swanee - Al Jolson,1920,8
4,OR,F,1920,Betty,152,5971,0.025456,Swanee - Al Jolson,1920,5
...,...,...,...,...,...,...,...,...,...,...
6048748,PR,M,2021,Yeshua,5,6808,0.000734,Levitating - Dua Lipa,2020,6
6048749,PR,M,2021,Zael,5,6808,0.000734,Levitating - Dua Lipa,2020,4
6048750,PR,M,2021,Zahid,5,6808,0.000734,Levitating - Dua Lipa,2020,5
6048751,PR,M,2021,Zariel,5,6808,0.000734,Levitating - Dua Lipa,2020,6
6048752,PR,M,2021,Zyan,5,6808,0.000734,Levitating - Dua Lipa,2020,4

### Analysis of data

In [69]:
# Top 30 most popular male names of all times.

m_top_30 = pd.read_sql_query("""

SELECT Name, SUM(Count) AS 'Total' FROM top_names_states
	WHERE Sex LIKE 'M'
		GROUP BY Name
		ORDER BY SUM(Count) DESC
		LIMIT 30;

""", engine)

m_top_30

           Name      Total
0         James  5036440.0
1          John  4898335.0
2        Robert  4748823.0
3       Michael  4384126.0
4       William  3931809.0
5         David  3625914.0
6        Joseph  2552653.0
7       Richard  2546422.0
8       Charles  2292033.0
9        Thomas  2265254.0
10  Christopher  2048092.0
11       Daniel  1935739.0
12      Matthew  1622396.0
13      Anthony  1455309.0
14       Donald  1405295.0
15         Paul  1367867.0
16         Mark  1352591.0
17       George  1341493.0
18       Andrew  1292081.0
19       Steven  1287068.0
20      Kenneth  1274460.0
21       Joshua  1228355.0
22       Edward  1227666.0
23        Kevin  1182188.0
24        Brian  1169586.0
25       Ronald  1078118.0
26      Timothy  1073578.0
27        Jason  1039967.0
28      Jeffrey   976157.0
29        Jacob   951524.0

In [70]:
# Top 30 most popular female names of all times.

f_top_30 = pd.read_sql_query("""

SELECT Name, SUM(Count) AS 'Total' FROM top_names_states
	WHERE Sex LIKE 'F'
		GROUP BY Name
		ORDER BY SUM(Count) DESC
		LIMIT 30;

""", engine)

f_top_30

         Name      Total
0        Mary  3748097.0
1    Patricia  1570406.0
2   Elizabeth  1561038.0
3    Jennifer  1468752.0
4       Linda  1448899.0
5     Barbara  1425270.0
6    Margaret  1137592.0
7       Susan  1109965.0
8     Dorothy  1055071.0
9     Jessica  1046230.0
10      Sarah  1037989.0
11      Nancy   985806.0
12      Karen   985294.0
13      Betty   984999.0
14       Lisa   963804.0
15      Helen   900748.0
16     Sandra   872369.0
17      Emily   856544.0
18     Ashley   851372.0
19   Kimberly   841722.0
20      Donna   827000.0
21   Michelle   812852.0
22      Carol   812607.0
23     Amanda   779651.0
24       Anna   755197.0
25      Laura   753617.0
26    Melissa   753495.0
27  Stephanie   742252.0
28    Rebecca   740204.0
29       Ruth   738624.0

In [100]:
# Top 30 most unique male names of all times (with at least 100 occurences).

m_bottom_30 = pd.read_sql_query("""

SELECT Name, SUM(Count) AS 'Total' FROM top_names_states
	WHERE Sex LIKE 'M'
        AND Count > 100
            GROUP BY Name
            ORDER BY SUM(Count) ASC
            LIMIT 30;

""", engine)

m_bottom_30

         Name  Total
0    Kristian  101.0
1        Sage  101.0
2      Shmuel  101.0
3      Shlomo  101.0
4      Scotty  102.0
5   Zachariah  102.0
6        Lupe  103.0
7      Yeriel  103.0
8        Kade  103.0
9      Keniel  103.0
10     Stefan  104.0
11  Giancarlo  104.0
12       Meir  104.0
13       Ares  105.0
14     Camron  105.0
15       Zaid  105.0
16      Ronny  105.0
17      Ellis  105.0
18     Boston  106.0
19     Lawson  106.0
20      Rohan  106.0
21     Apollo  107.0
22    Carlton  107.0
23   Mohammad  107.0
24     Yaakov  107.0
25    Brennan  107.0
26   Brittany  107.0
27   Sterling  107.0
28    Wilbert  107.0
29      Loren  108.0

In [101]:
# Top 30 most unique female names of all times (with at least 100 occurences).

f_bottom_30 = pd.read_sql_query("""

SELECT Name, SUM(Count) AS 'Total' FROM top_names_states
	WHERE Sex LIKE 'F'
        AND Count > 100
            GROUP BY Name
            ORDER BY SUM(Count) ASC
            LIMIT 30;

""", engine)

f_bottom_30

          Name  Total
0       Nayely  101.0
1      Saundra  101.0
2      Jaelynn  101.0
3        Deena  101.0
4       Lilian  101.0
5   Earnestine  101.0
6        Gayla  101.0
7        Dixie  101.0
8         Ryan  102.0
9       Saylor  102.0
10       Tawny  102.0
11   Jackeline  102.0
12     Janiyah  102.0
13    Herlinda  102.0
14   Katharine  102.0
15       Wendi  103.0
16     Adilene  103.0
17     Lakisha  103.0
18        Kris  103.0
19       Rivky  103.0
20      Ofelia  103.0
21      Leanne  104.0
22       Tonia  104.0
23       Kecia  104.0
24       Lexie  104.0
25       Alaya  104.0
26       Yitty  104.0
27       Kaley  105.0
28      Danika  105.0
29      Zariah  105.0

In [93]:
# Max change in popularity of male names (growing or declining).

max_change_m = pd.read_sql_query("""

SELECT Sex, Name, (MAX(Count) - MIN(Count)) AS max_change
	FROM top_names_states
		WHERE Sex = 'M'
	GROUP BY Name
	ORDER BY max_change DESC
	LIMIT 20;

""", engine)

max_change_m

   Sex         Name  max_change
0    M       Robert       10021
1    M         John        9634
2    M      Michael        9236
3    M        David        8111
4    M        James        7166
5    M      Richard        7150
6    M  Christopher        6717
7    M      William        6271
8    M       Daniel        5763
9    M         Mark        5535
10   M       Thomas        5310
11   M         Jose        5059
12   M       Joseph        4953
13   M      Matthew        4880
14   M        Jason        4776
15   M       Andrew        4556
16   M       Joshua        4297
17   M       Steven        4234
18   M      Anthony        4192
19   M     Jonathan        4113

In [94]:
# Max change in popularity of female names (growing or declining).

max_change_f = pd.read_sql_query("""

SELECT Sex, Name, (MAX(Count) - MIN(Count)) AS max_change
	FROM top_names_states
		WHERE Sex = 'F'
	GROUP BY Name
	ORDER BY max_change DESC
	LIMIT 20;

""", engine)

max_change_f

   Sex       Name  max_change
0    F       Mary        8179
1    F      Linda        7537
2    F    Jessica        6947
3    F   Jennifer        6060
4    F   Patricia        5673
5    F       Lisa        5607
6    F      Helen        5405
7    F    Barbara        5195
8    F      Susan        5135
9    F     Ashley        4974
10   F    Deborah        4562
11   F       Joan        4255
12   F  Stephanie        4003
13   F      Debra        3964
14   F      Donna        3911
15   F    Shirley        3871
16   F    Dorothy        3870
17   F     Amanda        3870
18   F      Carol        3832
19   F   Michelle        3828

In [102]:
#Most popular modern names (appeared after 1990), plus year when they appear for the first time. Male names.

pop_modern_m = pd.read_sql_query("""

SELECT MIN(Year) AS First_year, Name, SUM(Count) AS Total
	FROM top_names_states
		WHERE Sex = 'M'
    GROUP BY Name
		HAVING MIN(Year) BETWEEN '1990' AND '2022'
    ORDER BY SUM(Count) DESC
    LIMIT 30;

""", engine)

pop_modern_m

    First_year     Name     Total
0         1990   Jayden  234219.0
1         1990    Aiden  231784.0
2         1991    Jaxon   97160.0
3         1995    Ayden   81686.0
4         1990    Caden   64370.0
5         1991   Kayden   61092.0
6         1994   Jaxson   57516.0
7         1993   Kaiden   44365.0
8         2002   Maddox   39334.0
9         1991    Jalen   37274.0
10        1994   Cayden   36498.0
11        1992   Jaylen   35761.0
12        1992     Gael   34100.0
13        1997   Xander   33180.0
14        1990    Ryker   31927.0
15        1996   Jaiden   30213.0
16        2000  Maximus   29403.0
17        1996     Finn   26361.0
18        1998   Zander   24304.0
19        2002   Zayden   24241.0
20        1997   Karter   22485.0
21        1994   Caiden   20106.0
22        2000  Beckett   19891.0
23        1997      Jax   19683.0
24        1991   Gunner   19375.0
25        1996     Kobe   18777.0
26        1992  Phoenix   18442.0
27        1995   Legend   15277.0
28        2002     Iker   15210.0
29        1995  Atticus   12090.0

In [103]:
#Most popular modern names (appeared after 1990), plus year when they appear for the first time. Female names.

pop_modern_f = pd.read_sql_query("""

SELECT MIN(Year) AS First_year, Name, SUM(Count) AS Total
	FROM top_names_states
		WHERE Sex = 'F'
    GROUP BY Name
		HAVING MIN(Year) BETWEEN '1990' AND '2022'
    ORDER BY SUM(Count) DESC
    LIMIT 30;

""", engine)

pop_modern_f

    First_year      Name     Total
0         1991    Harper  107754.0
1         2000    Nevaeh   88936.0
2         1990   Kennedy   80955.0
3         1996     Khloe   43695.0
4         1996     Reese   37502.0
5         2006    Everly   29983.0
6         1990     Emery   29981.0
7         1992   Ryleigh   29482.0
8         1992  Izabella   27679.0
9         1994    Aniyah   27523.0
10        2005   Adalynn   25753.0
11        1997   Emerson   25523.0
12        2000    Adalyn   24433.0
13        1996    Londyn   22117.0
14        2001      Arya   20694.0
15        1994    Jayden   20655.0
16        1998   Cadence   20284.0
17        1991     Rylie   19645.0
18        1991   Madilyn   19273.0
19        2002    Finley   18216.0
20        1990    Alexus   17317.0
21        1997    Kinley   17039.0
22        1991     Amari   16354.0
23        1999   Brynlee   16302.0
24        1993     Aniya   16215.0
25        2002  Kaydence   16111.0
26        1991   Journey   15934.0
27        1999    Amiyah   15403.0
28        1994   Madisyn   15301.0
29        1996   Addyson   15254.0

In [97]:
#Most popular traditional names (disappeared by 1990), plus year when they appear for the last time. Male names.

pop_trad_m = pd.read_sql_query("""

SELECT MAX(Year) AS Last_year, Name, SUM(Count) AS Total
	FROM top_names_states
		WHERE Sex = 'M'
    GROUP BY Name
		HAVING MAX(Year) < '1990'
    ORDER BY SUM(Count) DESC
    LIMIT 10;

""", engine)

pop_trad_m

   Last_year     Name    Total
0       1989     Dick  25450.0
1       1986  Millard  11555.0
2       1965  Seymour  11190.0
3       1976     Gale   9197.0
4       1966   Morton   9156.0
5       1982   Buford   8091.0
6       1983  Merrill   7888.0
7       1980  Wilburn   7678.0
8       1989     Vern   7450.0
9       1985     Cleo   7443.0

In [98]:
#Most popular traditional names (disappeared by 1990), plus year when they appear for the last time. Female names.

pop_trad_f = pd.read_sql_query("""

SELECT MAX(Year) AS Last_year, Name, SUM(Count) AS Total
	FROM top_names_states
		WHERE Sex = 'F'
    GROUP BY Name
		HAVING MAX(Year) < '1990'
    ORDER BY SUM(Count) DESC
    LIMIT 10;

""", engine)

pop_trad_f

   Last_year     Name     Total
0       1988   Willie  121151.0
1       1978   Myrtle   87081.0
2       1982  Blanche   55136.0
3       1971   Beulah   51235.0
4       1985    Patti   41947.0
5       1982  Laverne   39426.0
6       1975      Pat   37627.0
7       1978     Eula   35101.0
8       1970    Bette   32113.0
9       1982      Pam   31340.0